[
  {
    "company": "Sharpen",
    "position": "Software Engineer Team Lead",
    "startDate": "June 2024",
    "endDate": "Current",
    "description": "- Led the migration and upgrade of a multi-million dollar application stack with 70+ applications, transitioning from on-premises data centers to multiple AWS regions\n - Utilized Docker, Bitbucket Pipelines, and AWS CDK to establish a PCI-compliant and fully redundant environment, ensuring scalability and reliability\n - Managed a team of 5 engineers across 3 product stacks, facilitating standups, bi-weekly one-on-ones, and performance reviews to drive team alignment and individual growth\n - Reviewed and approved pull requests to ensure high code quality and compliance with security standards, safeguarding sensitive data including PCI and HIPAA information\n"
  },
  {
    "company": "Sharpen",
    "position": "Software Engineer II",
    "startDate": "Oct 2023",
    "endDate": "May 2024",
    "description": "- Implemented company-wide adoption of CI/CD pipelines using Bitbucket Pipelines\n - Aided in backend development for a new customer facing product (ExpressJS, TypeScript), advancing it from Beta to GA\n - Managed and executed all legacy production releases, ensuring stability and adherence to test plans\n - Evaluated incoming Jira tickets to assess priority and provide time estimates for completion\n"
  },
  {
    "company": "Plum Voice",
    "position": "Senior Software Engineer",
    "startDate": "Mar 2023",
    "endDate": "Sep 2024",
    "description": "- Primary engineer on core web and voice processing application, utilized by the entire customer base, handling up to 10,000 concurrent connections during peak traffic (PHP/JS)\n - Shipped 20+ releases on a weekly cadence, enhancing customers’ web and voice experience with minimal service disruption\n - Contributed to AI product development on a modern stack (Python FastAPI)\n - Coordinated and ran code review meeting among team members to ensure company and data security best practices were being met in a relaxed collaborative environment\n"
  },
  {
    "company": "Plum Voice",
    "position": "Software Engineer",
    "startDate": "Sep 2021",
    "endDate": "Feb 2023",
    "description": "- Engineered multiple features for core voice application, integrating live with AWS DynamoDB, AWS S3, AWS Polly, and Google Dialogflow (PHP).\n - Redesigned and optimized logs database with PostgreSQL, enhancing capacity and query speed.\n - Contributed to core application upgrade from PHP5.3 to PHP7\n"
  },
  {
    "company": "Plum Voice",
    "position": "Junior Software Engineer",
    "startDate": "Sep 2020",
    "endDate": "Aug 2021",
    "description": "- Designed and coded RESTful API endpoints, enhancing customer control and accelerating information retrieval for applications.\n- Architected and developed custom PHP voice applications per customer specifications."
  }
]
